УправлениеСдачейКвартир/src/Documents/СписаниеСРассчетногоСчета/СписаниеСРассчетногоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСРассчетногоСчета</name>
  <basedOn>Document.ПринятиеВАренду</basedOn>
  <registerRecords>AccumulationRegister.ЗадолженностьПередАрендодателями</registerRecords>
  <registerRecords>AccumulationRegister.АвансыАрендодателям</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеСдачейКвартир/src/AccumulationRegisters/ЗадолженностьПередАрендодателями/ЗадолженностьПередАрендодателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗадолженностьПередАрендодателями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеСдачейКвартир/src/AccumulationRegisters/АвансыАрендодателям/АвансыАрендодателям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АвансыАрендодателям</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеСдачейКвартир/src/Documents/СписаниеСРассчетногоСчета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	СформироватьДвиженияВзаиморасчетыСАрендодателями();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Ответственный = ПараметрыСеанса.ТекущийПользователь;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПринятиеВАренду") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Договор = ДанныеЗаполнения.Договор;
		Сумма = ДанныеЗаполнения.Сумма;
		Ответственный = ДанныеЗаполнения.Ответственный;

	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияВзаиморасчетыСАрендодателями()

	Движения.ЗадолженностьПередАрендодателями.Очистить();
	Движения.АвансыАрендодателям.Очистить();
	
	Движения.ЗадолженностьПередАрендодателями.Записывать = Истина;
	Движения.АвансыАрендодателям.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадолженностьПередАрендодателямиОстатки1.СуммаОстаток КАК Долг
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПередАрендодателями.Остатки(&Период, Клиент = &Клиент
		|	И Договор = &Договор) КАК ЗадолженностьПередАрендодателямиОстатки1";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Долг = 0;
	
	Если РезультатЗапроса.Следующий() Тогда
		Долг = РезультатЗапроса.Долг;
	КонецЕсли;
	
	Если Сумма <= Долг Тогда
		Движение = Движения.ЗадолженностьПередАрендодателями.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Договор = Договор;
		Движение.Клиент = Клиент;
		Движение.Сумма = Сумма;
	Иначе
		
		Если Долг > 0 Тогда
			
			Движение = Движения.ЗадолженностьПередАрендодателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Клиент = Клиент;
			Движение.Сумма = Сумма;
		КонецЕсли;
		
		ОстатокАванса = Сумма - Долг;
		
		Если ОстатокАванса > 0 Тогда
			
			Движение = Движения.АвансыАрендодателям.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Клиент = Клиент;
			Движение.Сумма = Сумма;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
